brunoGrebstelis/Vending_machine/Vending_machine.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F7
ProjectManager.MainLocation=Core/Src
PA6.Mode=Full_Duplex_Slave
Dma.SPI1_TX.0.MemInc=DMA_MINC_ENABLE
Dma.SPI1_TX.0.PeriphInc=DMA_PINC_DISABLE
RCC.SAI1Freq_Value=96000000
USART2.IPParameters=VirtualMode-Asynchronous,BaudRate
Dma.SPI1_RX.1.Mode=DMA_CIRCULAR
PG6.Signal=GPIO_Output
Dma.SPI1_RX.1.FIFOMode=DMA_FIFOMODE_DISABLE
NVIC.I2C1_EV_IRQn=true\:0\:0\:false\:false\:true\:true\:true
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F767ZITx
SPI1.VirtualType=VM_SLAVE
Dma.I2C1_TX.2.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
PG2.Signal=GPIO_Output
PG4.Signal=GPIO_Output
PG4.Locked=true
PG6.Locked=true
RCC.PLLCLKFreq_Value=96000000
PG2.Locked=true
RCC.PLLQCLKFreq_Value=96000000
PB7.GPIO_FM7=__NULL
PF0.GPIOParameters=GPIO_Speed
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-MX_SPI1_Init-SPI1-false-HAL-true,4-MX_USART3_UART_Init-USART3-false-HAL-true,5-SystemClock_Config-RCC-false-HAL-false,6-MX_I2C1_Init-I2C1-false-HAL-true,7-MX_I2C4_Init-I2C4-false-HAL-true,8-MX_I2C2_Init-I2C2-false-HAL-true,9-MX_USART2_UART_Init-USART2-false-HAL-true,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true
PD8.Locked=true
PC14/OSC32_IN.Mode=LSE-External-Oscillator
RCC.PLLI2SRCLKFreq_Value=96000000
Dma.I2C1_TX.2.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
PG13.Signal=GPIO_Output
PD9.Mode=Asynchronous
PinOutPanel.RotationAngle=0
PG11.Signal=GPIO_Output
ProjectManager.StackSize=0x400
USART3.VirtualMode-Asynchronous=VM_ASYNC
Mcu.IP4=I2C4
Mcu.IP5=NVIC
Mcu.IP2=I2C1
I2C1.IPParameters=OwnAddress,Speed,Timing
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP3=I2C2
Mcu.IP0=CORTEX_M7
Mcu.IP1=DMA
SPI1.CLKPolarity=SPI_POLARITY_LOW
Mcu.UserConstants=
PA4.Mode=NSS_Signal_Hard_Input
RCC.LCDTFTFreq_Value=48000000
PF1.GPIOParameters=GPIO_Speed
RCC.SDMMCFreq_Value=16000000
Mcu.ThirdPartyNb=0
Dma.SPI1_RX.1.PeriphInc=DMA_PINC_DISABLE
SPI1.Direction=SPI_DIRECTION_2LINES
PG11.GPIO_PuPd=GPIO_PULLDOWN
PH0/OSC_IN.Mode=HSE-External-Oscillator
Mcu.IPNb=11
ProjectManager.PreviousToolchain=
PB6.Signal=I2C1_SCL
RCC.SPDIFRXFreq_Value=96000000
PB6.Mode=I2C
PH1/OSC_OUT.Signal=RCC_OSC_OUT
Mcu.Pin6=PA2
RCC.SAI2Freq_Value=96000000
Mcu.Pin7=PA3
PD8.Signal=USART3_TX
NVIC.DMA2_Stream0_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Mcu.Pin8=PA4
Mcu.Pin9=PA5
RCC.VCOSAIOutputFreq_Value=192000000
Mcu.Pin0=PC14/OSC32_IN
Mcu.Pin1=PC15/OSC32_OUT
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PF0
Dma.I2C1_TX.2.MemDataAlignment=DMA_MDATAALIGN_BYTE
Mcu.Pin3=PF1
Mcu.Pin4=PH0/OSC_IN
Mcu.Pin5=PH1/OSC_OUT
RCC.PLLSAIRCLKFreq_Value=96000000
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=25000000
PG13.Locked=true
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Dma.SPI1_RX.1.Priority=DMA_PRIORITY_LOW
USART2.VirtualMode-Asynchronous=VM_ASYNC
Mcu.IP10=USART3
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
PG13.GPIO_PuPd=GPIO_PULLDOWN
ProjectManager.FirmwarePackage=STM32Cube FW_F7 V1.16.2
MxDb.Version=DB.6.0.20
ProjectManager.BackupPrevious=false
RCC.VCOInputFreq_Value=1000000
SPI1.DataSize=SPI_DATASIZE_8BIT
File.Version=6
PB7.Signal=I2C1_SDA
SPI1.VirtualNSS=VM_NSSHARD
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PF1.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
NVIC.I2C1_ER_IRQn=true\:0\:0\:false\:false\:true\:true\:true
PH1/OSC_OUT.Mode=HSE-External-Oscillator
Dma.RequestsNb=3
PB6.GPIOParameters=GPIO_FM6,GPIO_Speed
ProjectManager.HalAssertFull=false
Dma.SPI1_RX.1.Direction=DMA_PERIPH_TO_MEMORY
ProjectManager.ProjectName=Vending_machine
PF15.Mode=I2C
Dma.SPI1_TX.0.Mode=DMA_CIRCULAR
Mcu.Package=LQFP144
PA6.Signal=SPI1_MISO
PG11.Locked=true
PG13.GPIOParameters=GPIO_PuPd
PC14/OSC32_IN.Signal=RCC_OSC32_IN
PB6.GPIO_FM6=__NULL
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=32000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
USART3.IPParameters=VirtualMode-Asynchronous
RCC.DFSDMFreq_Value=16000000
Dma.I2C1_TX.2.Instance=DMA1_Stream6
Dma.Request2=I2C1_TX
RCC.CECFreq_Value=32786.88524590164
PF14.Signal=I2C4_SCL
Dma.Request1=SPI1_RX
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PF0.Signal=I2C2_SDA
Dma.Request0=SPI1_TX
NVIC.DMA1_Stream6_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Dma.I2C1_TX.2.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.SPI1_RX.1.MemInc=DMA_MINC_ENABLE
ProjectManager.CustomerFirmwarePackage=
Dma.I2C1_TX.2.Direction=DMA_MEMORY_TO_PERIPH
RCC.PLLSAIQCLKFreq_Value=96000000
PA3.Signal=USART2_RX
PA5.Mode=Full_Duplex_Slave
PB7.GPIO_Speed=GPIO_SPEED_FREQ_LOW
Dma.SPI1_RX.1.Instance=DMA2_Stream0
I2C1.Speed=25
RCC.I2SFreq_Value=96000000
ProjectManager.ProjectFileName=Vending_machine.ioc
Dma.I2C1_TX.2.Mode=DMA_NORMAL
PG7.Locked=true
PA7.Mode=Full_Duplex_Slave
PG7.Signal=GPIO_Output
Mcu.PinsNb=29
ProjectManager.NoMain=false
SPI1.IPParameters=VirtualType,Mode,Direction,VirtualNSS,DataSize,CLKPolarity,CLKPhase
PG3.Signal=GPIO_Output
PG5.Locked=true
PG5.Signal=GPIO_Output
Dma.SPI1_RX.1.MemDataAlignment=DMA_MDATAALIGN_BYTE
PG3.Locked=true
ProjectManager.DefaultFWLocation=true
PD9.Signal=USART3_RX
SPI1.CLKPhase=SPI_PHASE_1EDGE
ProjectManager.DeletePrevious=true
PB14.Locked=true
USART2.BaudRate=9600
RCC.FamilyName=M
PG10.Signal=GPIO_Output
PG10.Locked=true
PF0.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PA3.Mode=Asynchronous
PF1.Mode=I2C
Dma.SPI1_TX.0.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.SPI1_TX.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
ProjectManager.TargetToolchain=STM32CubeIDE
Dma.I2C1_TX.2.Priority=DMA_PRIORITY_HIGH
PB7.GPIOParameters=GPIO_Speed,GPIO_FM7
Dma.SPI1_TX.0.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.SPI1_TX.0.Direction=DMA_MEMORY_TO_PERIPH
I2C1.Timing=0x10107BC0
NVIC.I2C2_ER_IRQn=true\:0\:0\:false\:false\:true\:true\:true
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=96000000
NVIC.DMA2_Stream3_IRQn=true\:0\:0\:false\:false\:true\:false\:true
RCC.PLLSAIoutputFreq_Value=96000000
PD8.Mode=Asynchronous
RCC.VCOI2SOutputFreq_Value=192000000
PB14.Signal=GPIO_Output
PA5.Signal=SPI1_SCK
Dma.SPI1_RX.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
RCC.PLLSAIPCLKFreq_Value=96000000
board=custom
RCC.VCOOutputFreq_Value=192000000
ProjectManager.LastFirmware=true
NVIC.SPI1_IRQn=true\:0\:0\:false\:false\:true\:true\:true
PH0/OSC_IN.Signal=RCC_OSC_IN
MxCube.Version=6.2.0
RCC.PLLI2SPCLKFreq_Value=96000000
SPI1.Mode=SPI_MODE_SLAVE
PF14.Mode=I2C
Dma.I2C1_TX.2.MemInc=DMA_MINC_ENABLE
RCC.RNGFreq_Value=96000000
VP_SYS_VS_Systick.Mode=SysTick
Dma.SPI1_TX.0.Instance=DMA2_Stream3
PF15.Signal=I2C4_SDA
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PF1.Signal=I2C2_SCL
ProjectManager.FreePins=false
RCC.IPParameters=CECFreq_Value,DFSDMFreq_Value,FamilyName,HSE_VALUE,HSI_VALUE,I2SFreq_Value,LCDTFTFreq_Value,LSI_VALUE,PLLCLKFreq_Value,PLLI2SPCLKFreq_Value,PLLI2SQCLKFreq_Value,PLLI2SRCLKFreq_Value,PLLQCLKFreq_Value,PLLSAIPCLKFreq_Value,PLLSAIQCLKFreq_Value,PLLSAIRCLKFreq_Value,PLLSAIoutputFreq_Value,RNGFreq_Value,SAI1Freq_Value,SAI2Freq_Value,SDMMC2Freq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,USBFreq_Value,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIOutputFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F767ZITx
RCC.PLLI2SQCLKFreq_Value=96000000
Mcu.Pin26=PB6
Mcu.Pin27=PB7
PA2.Signal=USART2_TX
Mcu.Pin24=PG11
ProjectManager.UnderRoot=true
Mcu.Pin25=PG13
I2C1.OwnAddress=0
Mcu.IP8=SYS
Mcu.IP9=USART2
Mcu.Pin28=VP_SYS_VS_Systick
Dma.SPI1_RX.1.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Mcu.IP6=RCC
Mcu.IP7=SPI1
ProjectManager.CoupleFile=false
PA4.Signal=SPI1_NSS
Mcu.Pin22=PG7
Mcu.Pin23=PG10
Mcu.Pin20=PG5
Mcu.Pin21=PG6
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PC15/OSC32_OUT.Mode=LSE-External-Oscillator
ProjectManager.CompilerOptimize=6
PB7.Mode=I2C
Dma.I2C1_TX.2.PeriphInc=DMA_PINC_DISABLE
ProjectManager.HeapSize=0x200
PF0.Mode=I2C
Mcu.Pin15=PD8
Dma.SPI1_TX.0.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.SPI1_TX.0.Priority=DMA_PRIORITY_LOW
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PD9
Mcu.Pin13=PF15
Mcu.Pin14=PB14
Mcu.Pin19=PG4
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PG2
NVIC.I2C2_EV_IRQn=true\:0\:0\:false\:false\:true\:true\:true
RCC.HSI_VALUE=16000000
Mcu.Pin18=PG3
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PA7
Mcu.Pin12=PF14
Mcu.Pin10=PA6
PA2.Mode=Asynchronous
PC15/OSC32_OUT.Signal=RCC_OSC32_OUT
PB6.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PD9.Locked=true
RCC.SDMMC2Freq_Value=16000000
ProjectManager.DeviceId=STM32F767ZITx
ProjectManager.LibraryCopy=1
PG11.GPIOParameters=GPIO_PuPd
PA7.Signal=SPI1_MOSI
isbadioc=false
